kendryte/canmv_k230/k230/boards/k230_canmv_01studio/mpconfigboard.h
#define MICROPY_HW_BOARD_NAME CONFIG_BOARD
#define MICROPY_HW_MCU_NAME   "K230"
